### development Part # 1
  #### Terraform Format and Style 🖌`skipped`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/16199612-dce8-4a99-bbd0-b098a60ac3a0/terraform-bin show -no-color tf.plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "example-cluster"
      + tags_all           = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.hello_world will be created
  + resource "aws_ecs_service" "hello_world" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "hello-world-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "hello-world-app"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.hello_world will be created
  + resource "aws_ecs_task_definition" "hello_world" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 1024
                  + image        = "heroku/nodejs-hello-world"
                  + memory       = 2048
                  + name         = "hello-world-app"
                  + portMappings = [
                      + {
                          + containerPort = 3000
                          + hostPort      = 3000
                        },
                    ]
                },
            ]
        )
      + cpu                      = "1024"
      + family                   = "hello-world-app"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
    }

  # aws_eip.gateway[0] will be created
  + resource "aws_eip" "gateway" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc                  = true
    }

  # aws_eip.gateway[1] will be created
  + resource "aws_eip" "gateway" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc                  = true
    }

  # aws_flow_log.default will be created
  + resource "aws_flow_log" "default" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "s3"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags_all                 = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_iam_role.example will be created
  + resource "aws_iam_role" "example" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.example will be created
  + resource "aws_iam_role_policy" "example" {
      + id     = (known after apply)
      + name   = "ecs-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_internet_gateway.gateway will be created
  + resource "aws_internet_gateway" "gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id   = (known after apply)
    }

  # aws_lb.default will be created
  + resource "aws_lb" "default" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = true
      + enable_deletion_protection = true
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "example-lb"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags_all                   = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.hello_world will be created
  + resource "aws_lb_listener" "hello_world" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_target_group.hello_world will be created
  + resource "aws_lb_target_group" "hello_world" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "example-target-group"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/api/1/resolve/default?path=/service/ecs-deep-dive"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_nat_gateway.gateway[0] will be created
  + resource "aws_nat_gateway" "gateway" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags_all             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
    }

  # aws_nat_gateway.gateway[1] will be created
  + resource "aws_nat_gateway" "gateway" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags_all             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
    }

  # aws_route.internet_access will be created
  + resource "aws_route" "internet_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.default will be created
  + resource "aws_s3_bucket" "default" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "cashewhands_s3_bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.default will be created
  + resource "aws_s3_bucket_public_access_block" "default" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_security_group.hello_world_task will be created
  + resource "aws_security_group" "hello_world_task" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic to ECS from VPC CIDR"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Deny"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow"
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3000
            },
        ]
      + name                   = "example-task-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.lb will be created
  + resource "aws_security_group" "lb" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic to Elastic from VPC CIDR"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Enable egress on port 80"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow loadbalancers access"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "example-alb-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.default will be created
  + resource "aws_vpc" "default" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.32.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
    }

Plan: 29 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_default_security_group.default will be created%0A  + resource "aws_default_security_group" "default" {%0A      + arn                    = (known after apply)%0A      + description            = (known after apply)%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # aws_ecs_cluster.main will be created%0A  + resource "aws_ecs_cluster" "main" {%0A      + arn                = (known after apply)%0A      + capacity_providers = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "example-cluster"%0A      + tags_all           = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A%0A      + default_capacity_provider_strategy {%0A          + base              = (known after apply)%0A          + capacity_provider = (known after apply)%0A          + weight            = (known after apply)%0A        }%0A%0A      + setting {%0A          + name  = "containerInsights"%0A          + value = "enabled"%0A        }%0A    }%0A%0A  # aws_ecs_service.hello_world will be created%0A  + resource "aws_ecs_service" "hello_world" {%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 1%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "hello-world-service"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + task_definition                    = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "hello-world-app"%0A          + container_port   = 3000%0A          + target_group_arn = (known after apply)%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = (known after apply)%0A          + subnets          = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.hello_world will be created%0A  + resource "aws_ecs_task_definition" "hello_world" {%0A      + arn                      = (known after apply)%0A      + container_definitions    = jsonencode(%0A            [%0A              + {%0A                  + cpu          = 1024%0A                  + image        = "heroku/nodejs-hello-world"%0A                  + memory       = 2048%0A                  + name         = "hello-world-app"%0A                  + portMappings = [%0A                      + {%0A                          + containerPort = 3000%0A                          + hostPort      = 3000%0A                        },%0A                    ]%0A                },%0A            ]%0A        )%0A      + cpu                      = "1024"%0A      + family                   = "hello-world-app"%0A      + id                       = (known after apply)%0A      + memory                   = "2048"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags_all                 = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A    }%0A%0A  # aws_eip.gateway[0] will be created%0A  + resource "aws_eip" "gateway" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags_all             = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + vpc                  = true%0A    }%0A%0A  # aws_eip.gateway[1] will be created%0A  + resource "aws_eip" "gateway" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags_all             = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + vpc                  = true%0A    }%0A%0A  # aws_flow_log.default will be created%0A  + resource "aws_flow_log" "default" {%0A      + arn                      = (known after apply)%0A      + iam_role_arn             = (known after apply)%0A      + id                       = (known after apply)%0A      + log_destination          = (known after apply)%0A      + log_destination_type     = "s3"%0A      + log_format               = (known after apply)%0A      + log_group_name           = (known after apply)%0A      + max_aggregation_interval = 600%0A      + tags_all                 = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + traffic_type             = "ALL"%0A      + vpc_id                   = (known after apply)%0A    }%0A%0A  # aws_iam_role.example will be created%0A  + resource "aws_iam_role" "example" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "vpc-flow-logs.amazonaws.com"%0A                        }%0A                      + Sid       = ""%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ecs-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy {%0A          + name   = (known after apply)%0A          + policy = (known after apply)%0A        }%0A    }%0A%0A  # aws_iam_role_policy.example will be created%0A  + resource "aws_iam_role_policy" "example" {%0A      + id     = (known after apply)%0A      + name   = "ecs-policy"%0A      + policy = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "logs:CreateLogGroup",%0A                          + "logs:CreateLogStream",%0A                          + "logs:PutLogEvents",%0A                          + "logs:DescribeLogGroups",%0A                          + "logs:DescribeLogStreams",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + role   = (known after apply)%0A    }%0A%0A  # aws_internet_gateway.gateway will be created%0A  + resource "aws_internet_gateway" "gateway" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags_all = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # aws_lb.default will be created%0A  + resource "aws_lb" "default" {%0A      + arn                        = (known after apply)%0A      + arn_suffix                 = (known after apply)%0A      + desync_mitigation_mode     = "defensive"%0A      + dns_name                   = (known after apply)%0A      + drop_invalid_header_fields = true%0A      + enable_deletion_protection = true%0A      + enable_http2               = true%0A      + enable_waf_fail_open       = false%0A      + id                         = (known after apply)%0A      + idle_timeout               = 60%0A      + internal                   = (known after apply)%0A      + ip_address_type            = (known after apply)%0A      + load_balancer_type         = "application"%0A      + name                       = "example-lb"%0A      + preserve_host_header       = false%0A      + security_groups            = (known after apply)%0A      + subnets                    = (known after apply)%0A      + tags_all                   = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + vpc_id                     = (known after apply)%0A      + zone_id                    = (known after apply)%0A%0A      + subnet_mapping {%0A          + allocation_id        = (known after apply)%0A          + ipv6_address         = (known after apply)%0A          + outpost_id           = (known after apply)%0A          + private_ipv4_address = (known after apply)%0A          + subnet_id            = (known after apply)%0A        }%0A    }%0A%0A  # aws_lb_listener.hello_world will be created%0A  + resource "aws_lb_listener" "hello_world" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 80%0A      + protocol          = "HTTP"%0A      + ssl_policy        = (known after apply)%0A      + tags_all          = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "redirect"%0A%0A          + redirect {%0A              + host        = "#{host}"%0A              + path        = "/#{path}"%0A              + port        = "443"%0A              + protocol    = "HTTPS"%0A              + query       = "#{query}"%0A              + status_code = "HTTP_301"%0A            }%0A        }%0A    }%0A%0A  # aws_lb_target_group.hello_world will be created%0A  + resource "aws_lb_target_group" "hello_world" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = false%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + name                               = "example-target-group"%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags_all                           = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + target_type                        = "ip"%0A      + vpc_id                             = (known after apply)%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 3%0A          + interval            = 30%0A          + matcher             = "200"%0A          + path                = "/api/1/resolve/default?path=/service/ecs-deep-dive"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = (known after apply)%0A          + unhealthy_threshold = 3%0A        }%0A%0A      + stickiness {%0A          + cookie_duration = (known after apply)%0A          + cookie_name     = (known after apply)%0A          + enabled         = (known after apply)%0A          + type            = (known after apply)%0A        }%0A    }%0A%0A  # aws_nat_gateway.gateway[0] will be created%0A  + resource "aws_nat_gateway" "gateway" {%0A      + allocation_id        = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = (known after apply)%0A      + tags_all             = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A    }%0A%0A  # aws_nat_gateway.gateway[1] will be created%0A  + resource "aws_nat_gateway" "gateway" {%0A      + allocation_id        = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = (known after apply)%0A      + tags_all             = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A    }%0A%0A  # aws_route.internet_access will be created%0A  + resource "aws_route" "internet_access" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + gateway_id             = (known after apply)%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A    }%0A%0A  # aws_route_table.private[0] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = ""%0A              + instance_id                = ""%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = (known after apply)%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags_all         = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # aws_route_table.private[1] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = ""%0A              + instance_id                = ""%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = (known after apply)%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags_all         = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # aws_route_table_association.private[0] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A  
  ```
  </details>
  *Pusher: @cashewhands, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*